Autodesk.Revit.DB.RoutingPreferenceManager.RemoveRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,System.Int32)
Removes an existing routing preference rule.
Thrown if the index is out of bounds.
groupType:
The routing preference group type in which the rule should be removed.
index:
The index position of removed routing preference rule in the group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index within groupType.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.AddRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingPreferenceRule,System.Int32)
Adds a new routing preference rule to the specified position in the rule group.
groupType:
The routing preference group type in which the rule should be added.
rule:
The new rule to be added.
index:
The zero-based index position where the new rule will be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index within groupType.
-or-
The rule cannot be added to the groupType.
-or-
Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.AddRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingPreferenceRule)
Adds a new routing preference rule to the rule group.
groupType:
The routing preference group in which the rule should be added.
rule:
The new rule to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rule cannot be added to the groupType.
-or-
Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.PreferredJunctionType
The preferred junction type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013